app/controllers/api/v1/sessions_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "roles", "first_name", "last_name", "reset_password_token", "reset_password_sent_at", "remember_created_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def signup
    @user = User.new(signup_params)

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def create
    if auth_token
      @user = User.find(JsonWebToken.decode(auth_token)[:user_id])