app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "feroz@gmail.com"], ["LIMIT", 1]]
---
  def self.authenticate(email, password)
    user = User.find_for_authentication(email: email)